Revit 2026 API

# ValueParsingOptions Methods

---

The ValueParsingOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ValueParsingOptions Class

Autodesk.Revit.DB Namespace